### Anonymous Function or Lambda function

- the function where we don't give any name, are called as anonymous function or lambda function
- __lambda__ keyword is used to declare an anonymous function

__Syntax:__
    
        (lambda arguments:operation) (call)

In [1]:
# create a lambda function that will add two numbers and return the same 

(lambda x,y : x+y) (10,20)

30

In [2]:
# create a lambda function that will multiply the two numbers and return the same 

(lambda x,y: x*y) (10,20)

200

#### we can assign the lambda() function to a variable and then we can call the variable n number of time

In [ ]:
# create a lambda function that will take two arguments and return the maximum number among the two 

max = (lambda x,y : x if x>y else y)

In [3]:
max(9,8)

9

In [4]:
max(-1,-3)

-1

In [5]:
max(100,1000)

1000

In [6]:
a = 10
b = 20

max = (lambda x,y: x if x>y else y)
max(a,b)

20

In [13]:
# create a lambda function that takes three variables as input from the user and returns the maximum among the three
a = int(input('Enter a number: '))
b = int(input('Enter a number: '))
c = int(input('Enter a number: '))

max = (lambda x,y,z: x if x>y and x>z else y if y>z and y>x else z)
max(a,b,c)

Enter a number:  100
Enter a number:  99
Enter a number:  101

101

In [15]:
# create a lambda function that takes three variables as input from the user and returns the minimum among the three

a = int(input('Enter a number: '))
b = int(input('Enter a number: '))
c = int(input('Enter a number: '))

min = (lambda x,y,z: x if x<y and x<z else y if y<z and y<x else z)
min(a,b,c)

Enter a number:  6
Enter a number:  7
Enter a number:  5

5

In [16]:
max1 = (lambda x,y,z: x if x>y and x>z else y if y>x and y>x else z)
max1(10,30,40)

30

#### Apply

In [17]:
import seaborn as sns

In [19]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic',
 'anagrams',
 'anagrams',
 'anscombe',
 'anscombe',
 'attention',
 'attention',
 'brain_networks',
 'brain_networks',
 'car_crashes',
 'car_crashes',
 'diamonds',
 'diamonds',
 'dots',
 'dots',
 'dowjones',
 'dowjones',
 'exercise',
 'exercise',
 'flights',
 'flights',
 'fmri',
 'fmri',
 'geyser',
 'geyser',
 'glue',
 'glue',
 'healthexp',
 'healthexp',
 'iris',
 'iris',
 'mpg',
 'mpg',
 'penguins',
 'penguins',
 'planets',
 'planets',
 'seaice',
 'seaice',
 'taxis',
 'taxis',
 'tips',
 'tips',
 'titanic',
 'titanic',
 'anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [21]:
data = sns.load_dataset('titanic')
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [22]:
data.head() # head() command will give us the first five rows

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [23]:
data.shape # tells us about the how many rows and columns are there in the dataset

(891, 15)

### Encoding 
- Label encoding 
- One hot encoding

In [ ]:
# I want to convert the sex column in the dataset such as where there is male - 1 and female -0

In [24]:
a = lambda x : 1 if x == 'male' else 0

In [25]:
a('male')

1

In [26]:
a('female')

0

In [27]:
data['Gender'] = data.sex.apply(lambda x : 1 if x == 'male' else 0)

In [28]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Gender
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1

In [32]:
# convert the class column such that First -1, Second-2 and Third - 3

data["Class2"] = data['class'].apply(lambda x: 1 if x == "First" else 2 if x == "Second" else 3)

In [33]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Gender,Class2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1,3
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0,3
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1,3

### filter(), map() and Reduce()tupletuple

### filter()

- It takes two arguments, the first argument is a function (named function or lambda function) and the second argument is going to be an iterable object
- It filters the values from the iterable 
- It will return a filter object
- To fetch out the value from this object, we have to typecast it to either a list or a tuple

In [34]:
lst = [i for i in range(1,11)]
lst

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [35]:
res = [i for i in lst if i%2 == 0]
res

[2, 4, 6, 8, 10]

In [36]:
# named function 

def even(x):
    if x%2 == 0:
        return True

In [37]:
f = filter(even, lst)
f

In [38]:
a = list(f)
a

[2, 4, 6, 8, 10]

In [39]:
#lambda function 
f1 = filter(lambda x: x%2 ==0, lst)
f1

In [40]:
a1 = list(f1)
a1

[2, 4, 6, 8, 10]

In [41]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Gender,Class2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1,3
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0,3
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1,3

In [42]:
data.shape

(891, 17)

In [45]:
import pandas as pd

In [46]:
data1 = filter(lambda x: x == 'female', data.sex)
data1 = pd.DataFrame(data1)
data1

          0
0    female
1    female
2    female
3    female
4    female
..      ...
309  female
310  female
311  female
312  female
313  female

[314 rows x 1 columns]

In [47]:
data = data.sex.apply(lambda x: x == 'female')

In [48]:
data1

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888     True
889    False
890    False
Name: sex, Length: 891, dtype: bool

In [60]:
text = 'Hello everyone, I hope your learning is going well'

# filter out the vowels from the text
Text1 = list(filter(lambda x: x in 'aeiouAEIOU',text))
print(Text1)

['e', 'o', 'e', 'e', 'o', 'e', 'I', 'o', 'e', 'o', 'u', 'e', 'a', 'i', 'i', 'o', 'i', 'e']

### map()

- It also takes two argument, where the first argument is a function (named function or anonymous function) and the second element will be an iterable
- The function that we pass in map() that should take 1 argument only]
- It performs specified operation on each element of an iterable and return us a map object
- to fetch the values from the map object, we have to typecast them to a list or a tuple

__Syntax:__
    
        map(function, iterable)
        map(lambda argument: operation, iterable)

In [53]:
lst

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [55]:
lst1 = []
for i in lst:
    lst1.append(i*5)
print(lst1)

[5, 10, 15, 20, 25, 30, 35, 40, 45, 50]

In [56]:
res = list(map(lambda x: x*5, lst))
res

[5, 10, 15, 20, 25, 30, 35, 40, 45, 50]

In [57]:
res1 = tuple(map(lambda x: x*5, lst))
res1

(5, 10, 15, 20, 25, 30, 35, 40, 45, 50)

In [62]:
d = {1:1, 2:2, 3:3}
a = list(d.values())

res = list(map(lambda x: x**2, a))
res

[1, 4, 9]

### Reduce() function

- It is available in the functools module in Python
- It is used to perform aggregation operation on the values of an iterabe
- __Aggregation Operation:__ sum, multiplication, divsion, max, min, average etc
- It also takes two arguments, where the first argument is a function and the second argument is an iterable object
- The function that we pass in the reduce function should have two arguments in it
- It is going to return 1 value at the end
- To use reduce() we first have to import functool module to our jupyter notebook first

In [63]:
from functools import reduce

In [64]:
lst

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [65]:
s = 0

for i in lst:
    s = s+i # or s += i

print(s)

55

In [ ]:
s = 0, i = 1, s = s+i ---> 0+1 ---> s = 1
s = 1. i = 2, s = s+i ----> 1+2 ----> s= 3
s = 3, i = 3, s = s+i ----> 3+3 ----> s= 6
s

In [67]:
lst

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [66]:
reduce(lambda x,y: x+y, lst)

55

In [ ]:
x = 1, y = 2, x+y = 3
x = 3, y = 3, x+y = 6
x = 6, y = 4, x+y = 10
x = 10, y = 5, x+y = 15

In [68]:
import numpy as np
np.random.seed(1) # 0-(2**32)-1

lst = list(np.random.randint(1,100,12))
lst

[38, 13, 73, 10, 76, 6, 80, 65, 17, 2, 77, 72]

In [69]:
reduce(lambda x, y: x if x>y else y, lst)

80

In [ ]:
x = 38, y = 10, x>y ---> 38
x - 38, y = 73, x>y---> 73
x = 73, y = 10, x>y ---> 73
x = 73, y = 76,

In [71]:
reduce(lambda x,y : x if x<y else y, lst)

2

### map vs reduce- 

- __map()__ will operate on each element of the iterable separately.
- __reduce()__ performs the aggregation on all elements. (Not one by one separately)

### Recursive function 

- When the function calls itself then they are called a recursive function
- Once the process is initiated, it will execute the code an infinite number of times, if we don't terminate the code

__Syntax:__
    
        def recursive_func():
            code
            code
            recursive func()

In [72]:
def password(pas):

    face_pass = 'ABC@123'

    if pas == face_pass:

        print('You have successfully logged in')
    else:
        print('Invalid Password')
        print('Try again')
        pas = input('Enter a password')
        password(pas) # function call

In [73]:
password('mickey0195@')

Invalid Password
Try again

Enter a password Mayankatulghai@123

Invalid Password
Try again

Enter a password Maa2365@

Invalid Password
Try again

Enter a password ABC@123

You have successfully logged in

In [74]:
def password():

    face_pass = 'ABC@123'
    pas = input('Enter a password')
    if pas == face_pass:

        print('You have successfully logged in')
    else:
        print('Invalid Password')
        print('Try again')
        
        password() # function call

In [75]:
password()

Enter a password mickey@123

Invalid Password
Try again

Enter a password Mayank_ghai@124

Invalid Password
Try again

Enter a password ABC@123

You have successfully logged in

### Factorial 

- 5! = 5*4*3*2*1 = 120
- n! = n*(n-1)*(n-2)*(n-3)*.....*3*2*1
- 0! = 1

In [76]:
def factorial(n):

    if n == 0:
        return 1
    else:
        return n*factorial(n-1)

In [77]:
factorial(5)

120

In [ ]:
5 ----> 5*4! -----> 5*4*3! ----> 5*4*3*2! ----->5*4*3*2*1! ----> 120

In [ ]:
factorial(-1)

In [ ]:
def factorial(n):
    if n>0:
        if n == 0:
            return 1
        else:
            return n*factorial(n-1)
    else:
        print('Invalid Input')

In [ ]:
Fibonacci series 

0, 1, 1, 2, 3, 5, 8, 13, 21, 34, ......

### Function Properties 

- Function aliasing
- A function can be passed as an argument to another function 
- A fuction can be defined or declared (Can be rewritten) in another function (nested function)
- A function can be called inside another function
- A function may return another function

### Function aliasing

- Assigning a function to a variable is known as function aliasing
- Giving some other name to an existing function is also known as function aliasing

In [79]:
def add(x,y):
    return x+y

In [80]:
add(5,6)

11

In [81]:
x = add # Function alisasing

In [82]:
x(8,9)

17

In [83]:
y = lambda x,y :x+y

In [84]:
y(7,12)

19

### A function can be passed as an argument to another function

#### Create a function that takes two arguments and returns the sum of those two numbers, Create another function that is going to take 3 arguments, the first argument is a function and the other arguments are the numbers that you want to pass in the first function that we have created, this function will return the squared of the result from the first function. This function should return the squared value of the result from the first function

In [85]:
def add(x,y):
    return x+y

In [86]:
def squared(f, x, y):
    s = f(x,y) # function call for the first function that we have declared
    return s**2

In [87]:
squared(add, 1,2) # f = add, x = 1, y = 2
# s = add(1,2) ----> s = 3
# s**2 = 9

9

In [88]:
squared(add, 10,9)

361

In [89]:
def multiply(x,y):
    return x*y

In [90]:
squared(multiply, 3, 2)
# f = multiply, x = 3, y = 2
# s = multiply(3,2) ---> 6
# s**2 === 36

36

#### A function can be written inside a function (nested function) and it can also return an another function

In [96]:
def outer():
    def inner():
        return 'Hello, I am an Inner function called inside an outer function '
    return inner()

In [99]:
outer()

'Hello, I am an Inner function called inside an outer function '

### Decorator 

- A decorator is a design pattern that allows modify or extend the behaviour of a function or a method without modifying their underlying code.

In [100]:
def div(a,b):
    return a/b

In [101]:
div(3,2)

1.5

In [102]:
div(1,0)

ZeroDivisionError: division by zero

In [105]:
def update_div(func):
    def inner(num, denum):
        if denum == 0:
            print('Error: Division by zero is not possible')
        else:
            return func(num, denum)
    return inner

# @update_div # decorator
def div(x,y):
    return x/y

res = div(10,2)
res

5.0

In [104]:
res = div(1,0)
res

Error: Division by zero is not possible